Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: In <<quarkus_integration,Quarkus>>, the engine used to format the messages is the same as the one injected by `@Inject Engine`. Therefore, you can make use of any Quarkus-specific integration feature such as <<template_extension_methods>>, <<injecting-beans-directly-in-templates>> or even <<type-safe-message-bundles>>.
ja_jp: <<quarkus_integration,Quarkus>> では、メッセージのフォーマットに使用されるエンジンは `@Inject Engine` によって注入されるものと同じです。したがって、<<template_extension_methods>>、<<injecting-beans-directly-in-templates>> または <<type-safe-message-bundles>> のような Quarkus 固有の統合機能を利用することができます。

source: In Basic Authentication, a username and password need to be sent with each request, which increases the risk of credentials being exposed.
ja_jp: ベーシック認証では、ユーザー名とパスワードをリクエスト毎に送信する必要があります。これは、認証情報が漏洩するリスクを高めます。

source: In Basic authentication, a username and password must be sent with each request, increasing the risk of exposing credentials.
ja_jp: Basic認証では、ユーザー名とパスワードをリクエストごとに送信しなければならず、クレデンシャルが漏洩するリスクが高まります。

source: In CDI a producer bean isn't limited to the application scope, it could just as well be @Singleton or @Dependent
ja_jp: CDIでは、プロデューサBeanはアプリケーションスコープに限定されず、@Singletonや@Dependentにすることもできます

source: In CDI applications, an event with qualifier `@Initialized(ApplicationScoped.class)` is fired when the application context is initialized. See https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#application_context[the spec, window="_blank"] for more info.
ja_jp: CDIアプリケーションでは、アプリケーションコンテキストが初期化されたときに、Qualifier `@Initialized(ApplicationScoped.class)` のイベントが発生します。詳しくは link:https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#application_context[仕様, window=_blank]をご覧ください。

source: In CDI applications, an event with qualifier `@Initialized(ApplicationScoped.class)` is fired when the application context is initialized. See https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#application_context[the spec, window="_blank"] for more info.
ja_jp: CDIアプリケーションでは、アプリケーションコンテキストが初期化されると、 `@Initialized(ApplicationScoped.class)` の修飾子を持つイベントが発生します。詳細は link:https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#application_context[仕様] を参照してください。

source: In CDI, a normal scoped bean must always declare a no-args constructor (this constructor is normally generated by the compiler unless you declare any other constructor). However, this requirement complicates constructor injection - you need to provide a dummy no-args constructor to make things work in CDI.
ja_jp: CDI では、通常のスコープ付き Bean は常に no-args コンストラクターを宣言しなければなりません (このコンストラクターは、他のコンストラクターを宣言しない限り、通常はコンパイラーによって生成されます)。しかし、この要件はコンストラクターの注入を複雑にします。CDI で動作させるためにはダミーの no-args コンストラクターを提供する必要があります。

source: In CDI, a producer method must be always annotated with `@Produces`.
ja_jp: CDI では、producer メソッドは常に `@Produces` とアノテーションされていなければなりません。

source: In CDI, an alternative bean may be selected either globally for an application by means of `@Priority`, or for a bean archive using a `beans.xml` descriptor. Quarkus has a simplified bean discovery and the content of `beans.xml` is ignored.
ja_jp: CDI では、代替の Bean は、 `@Priority` を使用してアプリケーションに対してグローバルに選択することも、 `beans.xml` 記述子を使用した Bean アーカイブ用に選択することもできます。Quarkus には単純化された Bean 検出があり、 `beans.xml` の内容は無視されます。

source: In CDI, an alternative bean may be selected either globally for an application by means of `@Priority`, or for a bean archive using a `beans.xml` descriptor. Quarkus has a simplified bean discovery, and the content of `beans.xml` is ignored.
ja_jp: CDI では、代替 Bean は、`@Priority` によってアプリケーションに対してグローバルに、または `beans.xml` 記述子を使用して Bean アーカイブに対して選択できます。Quarkus は簡素化された Bean 検出を使用しており、`beans.xml` の内容は無視されます。

source: In CDI, if you declare a field injection point you need to use `@Inject` and optionally a set of qualifiers.
ja_jp: CDI では、フィールド注入ポイントを宣言する場合は `@Inject` と任意で修飾子のセットを使用する必要があります。

source: In CDI, it's possible to inject multiple bean instances (aka contextual references) via the `jakarta.enterprise.inject.Instance` which implements `java.lang.Iterable`. However, it's not exactly intuitive. Therefore, a new way was introduced in Quarkus - you can inject a `java.util.List` annotated with the `io.quarkus.arc.All` qualifier. The type of elements in the list is used as the required type when performing the lookup.
ja_jp: CDIでは、 `java.lang.Iterable` を実装した `jakarta.enterprise.inject.Instance` を介して、複数のBeanインスタンス（別名：コンテキスト参照）を注入することが可能です。しかし、これは直感的に理解できるものではありません。そこで、Quarkusでは新しい方法を導入しました。 `io.quarkus.arc.All` 修飾子でアノテーションされた `java.util.List` を注入することができます。リスト内の要素の型は、検索を実行する際に必要な型として使用されます。

source: In CDI, it's possible to inject multiple bean instances (aka contextual references) via the `javax.enterprise.inject.Instance` which implements `java.lang.Iterable`. However, it's not exactly intuitive. Therefore, a new way was introduced in Quarkus - you can inject a `java.util.List` annotated with the `io.quarkus.arc.All` qualifier. The type of elements in the list is used as the required type when performing the lookup.
ja_jp: CDI では、 `java.lang.Iterable` を実装する `javax.enterprise.inject.Instance` を介して複数の Bean インスタンス (いわゆるコンテキスト参照) を注入することができます。ただし、それは正確には直感的ではありません。そのため、Quarkus に新しい方法が導入されました。 `io.quarkus.arc.All` 修飾子でアノテーションが付けられた `java.util.List` を注入できます。リスト内の要素のタイプは、ルックアップを実行するときに必要なタイプとして使用されます。

source: In Code + Or you can define the proto schema directly in user code by defining a produced bean of type `org.infinispan.protostream.FileDescriptorSource`.
ja_jp: コード内 + または、 `org.infinispan.protostream.FileDescriptorSource` 型のプロデュースされた Bean を定義することで、ユーザーコード内で直接プロトスキーマを定義することもできます。

source: In Code + Or you can define the proto schema directly in user code by defining a produced bean of type `org.infinispan.protostream.schema.Schema`.
ja_jp: コード内 または、 `org.infinispan.protostream.schema.Schema` 型のプロデュースされた Bean を定義することで、ユーザーコード内で直接プロトスキーマを定義することもできます。

source: In Eclipse, click on: `File -> Import`. In the wizard, select: `Gradle -> Existing Gradle Project`. On the next screen, select the root location of the project. The next screen list the found modules; select the generated project and click on `Finish`. Done!
ja_jp: Eclipse で、 `File → Import` をクリックします。ウィザードで、 `Gradle → Existing Gradle Project` を選択します。次の画面で、プロジェクトのルートの場所を選択します。次の画面では、見つかったモジュールのリストが表示されるので、生成されたプロジェクトを選択して `Finish` をクリックします。

source: In Eclipse, click on: `File -> Import`. In the wizard, select: `Maven -> Existing Maven Project`. On the next screen, select the root location of the project. The next screen list the found modules; select the generated project and click on `Finish`. Done!
ja_jp: Eclipse で、 `File → Import` をクリックします。ウィザードで、 `Maven → Existing Maven Project` を選択します。次の画面で、プロジェクトのルートの場所を選択します。次の画面では、見つかったモジュールのリストが表示されるので、生成されたプロジェクトを選択して `Finish` をクリックします。

source: In Example 1, the `db-kind`(`postgresql`) was used as a service key. In this example, because the datasource is named, according to convention, the datasource name (`fruits-db`) is used instead.
ja_jp: 例 1 では、`db-kind`(`postgresql`) がサービスキーとして使用されました。この例では、規約に従ってデータソースに名前がついているので、データソース名 (`fruits-db`) が代わりに使用されます。

source: In GraphQL it is possible to make multiple queries at once.
ja_jp: GraphQLでは、一度に複数のクエリを実行することが可能です。

source: In GraphQL, it is possible to make multiple queries at once.
ja_jp: GraphQLでは、一度に複数のクエリを実行することが可能です。

source: In High Availability production deployments, it is common to have multiple Infinispan Clusters that are distributed across various Data Centers worldwide. Infinispan offers the capability to connect these clusters and configure backups between them. This enables seamless switching between clusters through both automated and manual methods using a single connection. To achieve this, it is necessary to configure the client to direct to the backup clusters.
ja_jp: 高可用性の本番環境では、複数のInfinispanクラスタが世界中のさまざまなデータセンターに分散しているのが一般的です。Infinispanはこれらのクラスタに接続し、クラスタ間のバックアップを設定する機能を提供します。これにより、単一の接続を使用した自動および手動の方法によるクラスタ間のシームレスな切り替えが可能になります。これを実現するには、バックアップクラスタに直接接続するようにクライアントを設定する必要があります。

source: In Infinispan, *lifespan* refers to a configuration parameter that determines the maximum time an entry (or an object) can remain in the cache since it was created or last accessed before it is considered expired and removed from the cache.
ja_jp: Infinispan では、*lifespan* は設定パラメーターの 1 つであり、エントリー (またはオブジェクト) が、 作成または最終アクセスされてから期限切れと見なされキャッシュから削除されるまで、 キャッシュに残ることができる最大時間を決定します。

source: In IntelliJ IDEA:
ja_jp: IntelliJ IDEA:

source: In IntelliJ:
ja_jp: IntelliJで以下を実施します:

source: In JSON Web Key (JWK) format
ja_jp: JSON Web Key (JWK) 形式

source: In JVM mode, any version of `io.confluent:kafka-avro-serializer` can be used. In native mode, Quarkus only supports the following versions:
ja_jp: JVMモードでは、 `io.confluent:kafka-avro-serializer` のどのバージョンでも使用できます。 ネイティブモードでは、 Quarkus は以下のバージョンのみをサポートしています。

source: In JVM mode, any version of `io.confluent:kafka-avro-serializer` can be used. In native mode, Quarkus supports the following versions: `6.2.x`, `7.0.x`, `7.1.x`, `7.2.x`, `7.3.x`.
ja_jp: JVMモードでは、 `io.confluent:kafka-avro-serializer` の任意のバージョンを使用できます。 ネイティブモードでは、Quarkusは以下のバージョンをサポートしています： `6.2.x` `7.0.x` `7.1.x` `7.2.x` `7.3.x` 。

source: In JVM mode, any version of `io.confluent:kafka-json-schema-serializer` can be used. In native mode, Quarkus supports the following versions: `6.2.x`, `7.0.x`, `7.1.x`, `7.2.x`, `7.3.x`.
ja_jp: JVM モードでは、`io.confluent:kafka-json-schema-serializer` の任意のバージョンを使用できます。 ネイティブモードでは、Quarkus はバージョン `6.2.x`、`7.0.x`、`7.1.x`、`7.2.x`、`7.3.x` をサポートします。

source: In JVM mode, it will work out of the box. However, to compile your application to a native executable, you need to add `quarkus.kafka.snappy.enabled=true` to your `application.properties`.
ja_jp: JVM モードでは、そのまますぐに動作します。 ただし、アプリケーションをネイティブ実行可能ファイルにコンパイルするには、 `application.properties` に `quarkus.kafka.snappy.enabled=true` を追加する必要があります。

source: In JVM mode, it will work out of the box. However, to compile your application to a native executable, you need to:
ja_jp: JVMモードでは、変更なしで動作します。しかし、アプリケーションをネイティブ実行可能ファイルにコンパイルするには、以下のことが必要です。

source: In JVM mode, this works great because, as a developer, you don't need to worry about the configuration. However, in native mode, by depending on the OpenShift extension you're bringing in many resources that your application might not need unnecessarily increasing its size.
ja_jp: JVM モードでは、開発者として設定を気にする必要がないため、これは非常にうまく機能します。しかし、ネイティブモードでは、OpenShift エクステンションに依存することで、アプリケーションが不要な多くのリソースを取り込み、そのサイズを不必要に増加させる可能性があります。

source: In January 2021, the Quarkus team announced RESTEasy Reactive, a novel way to serve HTTP API in Quarkus. Since its introduction, RESTEasy Reactive adoption has been quite good, and we plan to make it the default approach to implement HTTP API shortly.
ja_jp: 2021年1月、Quarkusチームは、QuarkusでHTTP APIを提供するための斬新な方法であるRESTEasy Reactiveを発表しました。この発表以来、RESTEasy Reactiveの採用は非常に好調で、まもなくHTTP APIを実装するデフォルトの方法にする予定です。

source: In Java applications, proxies are commonly required in environments where direct outbound network access is restricted. This is typical in corporate networks. This is also common in cloud environments with strict security rules. This is often required in production systems that require traffic inspection and auditing.
ja_jp: Java アプリケーションでは、プロキシーは、直接的なアウトバウンドネットワークアクセスが制限されている環境で一般的に必要とされます。これは、企業ネットワークや、厳格なセキュリティールールを持つクラウド環境で典型的です。また、トラフィックの検査と監査を必要とする本番システムでも頻繁に要求されます。

source: In JsonWebKey format
ja_jp: JsonWebKeyフォーマットで

source: In July 2019 the team discovered Quarkus through its related work with other frameworks in the Java ecosystem. They were especially interested in Quarkus’ promise of stellar performance and smaller footprint, which is comparable to Node.js and even Golang. Even better, Quarkus’ https://quarkus.io/guides/kotlin[first class support for Kotlin^] meant the team could re-use both their Java and Kotlin experience with Quarkus.
ja_jp: 2019年7月、チームは、Javaエコシステムの他のフレームワークとの関連作業を通じてQuarkusを発見しました。彼らは特に、Quarkusが約束する、Node.jsやGolangに匹敵する優れたパフォーマンスと小さなフットプリントに興味を持ちました。さらに、Quarkusは link:https://quarkus.io/guides/kotlin[Kotlinをファーストクラスでサポートしている^]ため、チームはJavaとKotlinの両方の経験をQuarkusで再利用することができました。

source: In Kafka, a consumer group is a set of consumers which cooperate to consume data from a topic. A topic is divided into a set of partitions. The partitions of a topic are assigned among the consumers in the group, effectively allowing to scale consumption throughput. Note that each partition is assigned to a single consumer from a group. However, a consumer can be assigned multiple partitions if the number of partitions is greater than the number of consumer in the group.
ja_jp: Kafka では、コンシューマーグループは、トピックからのデータを消費するために協力する一連のコンシューマーです。トピックは一連のパーティションに分割されます。トピックのパーティションは、グループ内のコンシューマー間で割り当てられ、消費スループットを効果的にスケーリングできます。各パーティションは、グループからの単一のコンシューマーに割り当てられることに注意してください。ただし、パーティションの数がグループ内のコンシューマーの数よりも多い場合は、コンシューマーに複数のパーティションを割り当てることができます。

source: In Kafka, we produce and consume records. A record contains a key and a value. Let's say we will use the movie's publication year as key and the title as value.
ja_jp: Kafka では、レコードを生成、消費します。レコードにはキーと値が含まれています。例えば、映画の公開年をキーにして、タイトルを値にするとします。

source: In Kubernetes, we recommend the https://infinispan.org/docs/infinispan-operator/main/operator.html[Infinispan Operator]. Additionally, grab a look to the https://infinispan.org/tutorials/simple/simple_tutorials.html#cross-site-replication_remote-cache-tutorials[Cross Site Replication] tutorial. You will learn how to run two separate Infinispan Clusters with docker compose (for local dev) and the Operator.
ja_jp: Kubernetesでは、 link:https://infinispan.org/docs/infinispan-operator/main/operator.html[Infinispan Operator] をお勧めします。さらに、 link:https://infinispan.org/tutorials/simple/simple_tutorials.html#cross-site-replication_remote-cache-tutorials[Cross Site Replication] のチュートリアルをご覧ください。ここでは、docker compose（ローカル開発用）とOperatorを使用して、2つの別々のInfinispanクラスターを実行する方法を学びます。

source: In Maven there appears to be a notion of the top-level project (that is exposed as a project property `${session.topLevelProject.basedir.absolutePath}`) and the multi-module project directory (that is available as property `${maven.multiModuleProjectDirectory}`). These directories might not always match!
ja_jp: Mavenでは、トップレベルのプロジェクト(プロジェクトのプロパティとして公開されています。 `${session.topLevelProject.basedir.absolutePath}`)と、マルチモジュールのプロジェクトディレクトリ(プロパティとして公開されています。 `${maven.multiModuleProjectDirectory}`)という概念があるようです。これらのディレクトリは常に一致するとは限りません。

source: In MongoDB, a transaction is only possible on a replicaset, luckily our xref:mongodb.adoc#dev-services[Dev Services for MongoDB] setups a single node replicaset so it is compatible with transactions.
ja_jp: MongoDBでは、トランザクションはレプリカセットでのみ可能です。幸運なことに、 link:mongodb.html#dev-services[MongoDBの開発サービス] では、シングルノードのレプリカセットを設定するので、トランザクションと互換性があります。

source: In NetBeans:
ja_jp: NetBeans:

source: In November 2025, I presented part of this work during the first Quarkus community call (see https://github.com/quarkusio/quarkus/discussions/50682[here] for more information about our community calls).
ja_jp: 2025年11月、私は最初のQuarkusコミュニティコールでこの作業の一部を発表しました（コミュニティコールの詳細については https://github.com/quarkusio/quarkus/discussions/50682[こちら] を参照してください）。

source: In OIDC, you validate the ID token as proof of authentication, whereas in OAuth2, you validate the access token. This is done by subsequently calling an endpoint that requires the access token and that typically returns user information. This approach is similar to the OIDC <<code-flow-user-info,UserInfo>> approach, with `UserInfo` fetched by Quarkus OIDC on your behalf.
ja_jp: OIDC の場合は、認証の証明として ID トークンを検証しますが、OAuth2 の場合はアクセストークンを検証します。 これは、アクセストークンを必要とし、通常はユーザー情報を返すエンドポイントを後で呼び出すことによって実行されます。 これは、OIDC の <<code-flow-user-info,UserInfo>> アプローチと同様のアプローチで、ユーザーに代わって Quarkus OIDC が `UserInfo` を取得します。

source: In OpenJDK 25, the following Project Leyden-related JEPs are available:
ja_jp: OpenJDK 25 では、以下の Project Leyden 関連 JEP が利用可能です。

source: In Pulsar, consumers need to provide a `subscriptionName` for topic subscriptions. If not provided the connector generates a unique **subscription name**.
ja_jp: Pulsar では、コンシューマーがトピックサブスクリプションの `subscriptionName` を指定する必要があります。 指定されていない場合、コネクターが一意の **サブスクリプション名** を生成します。

source: In Quarkus 2.14, the minimum GraalVM/Mandrel version is now 22.2.0.
ja_jp: Quarkus 2.14では、GraalVM/Mandrelの最小バージョンは22.2.0になりました。

source: In Quarkus 2.2.0, we introduced a new dispatching strategy based on the method signatures. The Quarkus build-time approach lets us be wise and deduce if a method should be called on the I/O thread or a worker thread at build time, reducing the runtime overhead.
ja_jp: Quarkus 2.2.0では、メソッドのシグネチャに基づいた新しいディスパッチ戦略を導入しました。Quarkusのビルドタイムアプローチでは、ビルド時にメソッドがI/Oスレッドとワーカースレッドのどちらで呼び出されるべきかを賢く推測し、ランタイムのオーバーヘッドを削減することができます。

source: In Quarkus 2.5, the gRPC extension does not propagate statistics of the calls, such as response time or encountered errors. Therefore, a load balancer that relies on this data, such as least-response-time, will not work correctly. We are working on it and hope to have it in Quarkus 2.6.
ja_jp: Quarkus 2.5では、gRPCエクステンションは、応答時間や発生したエラーなどのコールの統計情報を伝搬しません。そのため、最小応答時間など、このデータに依存するロードバランサーは正しく動作しません。現在対応中で、Quarkus 2.6では対応できるようにしたいと考えています。

source: In Quarkus 2.6, we integrated UPX compression in the Quarkus build. So, Quarkus can automatically produce a compressed executable. This post explains how you can use this new feature. But, before going further, you need to understand that **nothing comes for free**. The compressed executable is smaller on disk, but its memory usage is higher. So make sure to read the "big warning" section before using it.
ja_jp: Quarkus 2.6では、UPX圧縮をQuarkusのビルドに統合しました。これにより、Quarkusは自動的に圧縮された実行可能ファイルを作成することができます。この記事では、この新機能の使い方を説明します。しかし、先に進む前に、 *無料で手に入るものはない* ということを理解しておく必要があります。圧縮された実行可能ファイルは、ディスク上では小さくなりますが、メモリ使用量は多くなります。そのため、使用する前に必ず「大きな警告」の項目をお読みください。

source: In Quarkus 3.25, a new API for creating https://quarkus.io/guides/dev-services[Dev Services] was introduced. This new model fixes a problem where all Dev Services for all tests would start in the JUnit discovery phase, potentially causing port conflicts, configuration cross-talk, and excessive resource usage. This issue was a side effect of the link:/blog/test-classloading-rewrite[test classloading rewrite] in Quarkus 3.22. As well as reducing resource consumption, we also hope the API makes it simpler for extension authors to create Dev Services, and moves some of the heavy lifting around managing discovery and container re-use to Quarkus core.
ja_jp: Quarkus 3.25 では、 https://quarkus.io/guides/dev-services[Dev Services] を作成するための新しい API が導入されました。この新しいモデルは、すべてのテストのためのすべての Dev Services が JUnit のディスカバリーフェーズで開始され、ポートの競合、設定の混信、および過剰なリソース消費を引き起こす可能性があるという問題を修正します。この問題は、Quarkus 3.22 における link:/blog/test-classloading-rewrite[テストクラスローディングの書き換え] の副作用でした。リソース消費の削減に加え、この API がエクステンション開発者にとって Dev Services の作成をよりシンプルにし、ディスカバリーの管理やコンテナーの再利用といった重い処理の一部を Quarkus コアに移行させることも期待しています。

source: In Quarkus 3.31, we introduced the `quarkus` packaging, which comes with its own lifecycle. This packaging is intended to be used only for the Quarkus application module itself. It automatically binds the goals of the `quarkus-maven-plugin`, resulting in less boilerplate in your `pom.xml` (and no changes required when new goals are added). More importantly, it does not bind the `maven-jar-plugin` execution, nor the `maven-install-plugin`, which leads to significantly faster builds for large applications, and benefits all applications overall.
ja_jp: Quarkus 3.31では、独自のライフサイクルを持つ `quarkus` パッケージングを導入しました。このパッケージングは、Quarkusアプリケーションモジュール自体にのみ使用されることを意図しています。これにより、`quarkus-maven-plugin` のゴールが自動的にバインドされ、`pom.xml` のボイラープレートが減り（新しいゴールが追加されても変更は不要）、さらに重要なことに、`maven-jar-plugin` の実行も `maven-install-plugin` もバインドされません。これにより、大規模なアプリケーションのビルドが大幅に高速化され、すべてのアプリケーションに全体的なメリットをもたらします。

source: In Quarkus Messaging, the default mechanism for propagating context between different processing stages is the link:https://smallrye.io/smallrye-reactive-messaging/latest/concepts/message-context[message context]. This provides a consistent way to pass context information along with the message as it flows through different stages.
ja_jp: Quarkus Messaging では、異なる処理ステージ間でコンテキストを伝搬するためのデフォルトのメカニズムは、link:https://smallrye.io/smallrye-reactive-messaging/latest/concepts/message-context[メッセージコンテキスト] です。これにより、異なるステージを流れるメッセージとともにコンテキスト情報を渡す一貫した方法が提供されます。

source: In Quarkus Security, `quarkus-oidc` supports a non-standard `client_secret_post_jwt` authentication method, which you can configure as follows:
ja_jp: Quarkus Security では、 `quarkus-oidc` は、非標準の `client_secret_post_jwt` 認証方法をサポートされています。この認証方法は、以下のように設定できます。

source: In Quarkus `web-app` applications, only the `IdToken` is verified by default because the access token is not used to access the current Quarkus `web-app` endpoint and is intended to be propagated to services that expect it. If you expect the access token to contain the roles required to access the current Quarkus endpoint (`quarkus.oidc.roles.source=accesstoken`), then it will also be verified.
ja_jp: Quarkus の `web-app` アプリケーションでは、アクセストークンは現在の Quarkus `web-app` エンドポイントへのアクセスには使用されず、このアクセストークンを必要とするサービスに伝播されることが意図されているため、デフォルトでは `IdToken` のみが検証されます。 アクセストークンに現在の Quarkus エンドポイント (`quarkus.oidc.roles.source=accesstoken`) にアクセスするために必要なロールが含まれていることが予想される場合は、それも検証されます。

source: In Quarkus all JAX-RS resources are treated as CDI beans. It's possible to inject other beans via `@Inject`, bind interceptors using bindings such as `@Transactional`, define `@PostConstruct` callbacks, etc.
ja_jp: Quarkusでは、すべてのJAX-RSリソースはCDI Bean として扱われます。 `@Inject` を介して他の Bean を注入したり、 `@Transactional` のようなバインディングを使用してインターセプターをバインドしたり、 `@PostConstruct` コールバックを定義したりすることが可能です。

source: In Quarkus all Jakarta REST resources are treated as CDI beans. It's possible to inject other beans via `@Inject`, bind interceptors using bindings such as `@Transactional`, define `@PostConstruct` callbacks, etc.
ja_jp: Quarkusでは、すべてのJakarta RESTリソースはCDI Beanとして扱われます。 `@Inject` を使って他の Bean を注入したり、 `@Transactional` などのバインディングを使ってインターセプターをバインドしたり、 `@PostConstruct` コールバックを定義したりすることが可能です。

source: In Quarkus core repo, the extension codestarts are all in the same https://github.com/quarkusio/quarkus/tree/main/devtools/project-core-extension-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts[module, window="_blank"].
ja_jp: Quarkusのコアレポジトリでは、エクステンションのcodestartはすべて同じ link:https://github.com/quarkusio/quarkus/tree/main/devtools/project-core-extension-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts[モジュール, window=_blank]に入っています。

source: In Quarkus core, you also have to rebuild the `devtools/bom-descriptor-json` module to bind the codestart with the extension in the platform descriptor.
ja_jp: また、Quarkus coreでは、 `devtools/bom-descriptor-json` モジュールを再ビルドして、codestartをplatform descriptorのエクステンションにバインドする必要があります。

source: In Quarkus dev mode, when files are touched, it will trigger the `CertificateUpdatedEvent` much more frequently.
ja_jp: Quarkus 開発モードでは、ファイルが変更されると、 `CertificateUpdatedEvent` がより頻繁にトリガーされます。

source: In Quarkus dev mode, when files are touched, the `CertificateUpdatedEvent` is triggered much more frequently.
ja_jp: Quarkus 開発モードでは、ファイルがタッチされると、`CertificateUpdatedEvent` がより頻繁にトリガーされます。
